/*
 *  TOPPERS/ASP Kernel
 *      Toyohashi Open Platform for Embedded Real-Time Systems/
 *      Advanced Standard Profile Kernel
 * 
 *  Copyright (C) 2008-2011 by Embedded and Real-Time Systems Laboratory
 *              Graduate School of Information Science, Nagoya Univ., JAPAN
 *  Copyright (C) 2015      by 3rd Designing Center
 *              Imageing System Development Division RICOH COMPANY, LTD.
 * 
 *  ╛х╡н├°║√╘в╝╘д╧бд░╩▓╝д╬(1)б┴(4)д╬╛Є╖БEЄ╦■д┐д╣╛БEчд╦╕┬дъбд╦▄е╜е╒е╚ежез
 *  евб╩╦▄е╜е╒е╚ежезевдЄ▓■╩╤д╖д┐дтд╬дЄ┤▐дрбе░╩▓╝╞▒д╕б╦дЄ╗╚═╤бж╩г└╜бж▓■
 *  ╩╤бж║╞╟█╔█б╩░╩▓╝бд═°═╤д╚╕╞д╓б╦д╣дБE│д╚дЄ╠╡╜■д╟╡Ў┬·д╣дБEе
 *  (1) ╦▄е╜е╒е╚ежезевдЄе╜б╝е╣е│б╝е╔д╬╖┴д╟═°═╤д╣дБEБEчд╦д╧бд╛х╡нд╬├°║БE *      ╕в╔╜╝ибдд│д╬═°═╤╛Є╖БEкдшд╙▓╝╡нд╬╠╡╩▌╛┌╡м─ъдмбдд╜д╬д▐д▐д╬╖┴д╟е╜б╝
 *      е╣е│б╝е╔├цд╦┤▐д▐дБE╞дддБE│д╚бе
 *  (2) ╦▄е╜е╒е╚ежезевдЄбдещеде╓ещеБE┴╝░д╩д╔бд┬╛д╬е╜е╒е╚ежезев│л╚пд╦╗╚
 *      ═╤д╟дндБE┴д╟║╞╟█╔█д╣дБEБEчд╦д╧бд║╞╟█╔█д╦╚╝дже╔енехесеєе╚б╩═°═╤
 *      ╝╘е▐е╦ехевеБE╩д╔б╦д╦бд╛х╡нд╬├°║√╘в╔╜╝ибдд│д╬═°═╤╛Є╖БEкдшд╙▓╝╡н
 *      д╬╠╡╩▌╛┌╡м─ъдЄ╖╟║▄д╣дБE│д╚бе
 *  (3) ╦▄е╜е╒е╚ежезевдЄбд╡б┤БE╦┴╚д▀╣■дрд╩д╔бд┬╛д╬е╜е╒е╚ежезев│л╚пд╦╗╚
 *      ═╤д╟днд╩дд╖┴д╟║╞╟█╔█д╣дБEБEчд╦д╧бд╝бд╬ддд║дБEлд╬╛Є╖БEЄ╦■д┐д╣д│
 *      д╚бе
 *    (a) ║╞╟█╔█д╦╚╝дже╔енехесеєе╚б╩═°═╤╝╘е▐е╦ехевеБE╩д╔б╦д╦бд╛х╡нд╬├БE *        ║√╘в╔╜╝ибдд│д╬═°═╤╛Є╖БEкдшд╙▓╝╡нд╬╠╡╩▌╛┌╡м─ъдЄ╖╟║▄д╣дБE│д╚бе
 *    (b) ║╞╟█╔█д╬╖┴┬╓дЄбд╩╠д╦─ъдсдБE¤╦бд╦дшд├д╞бдTOPPERSе╫е·┴╕езепе╚д╦
 *        ╩є╣Ёд╣дБE│д╚бе
 *  (4) ╦▄е╜е╒е╚ежезевд╬═°═╤д╦дшдБE╛└▄┼кд▐д┐д╧┤╓└▄┼кд╦└╕д╕дБEддлд╩дБE╗
 *      │▓длдщдтбд╛х╡н├°║√╘в╝╘дкдшд╙TOPPERSе╫е·┴╕езепе╚дЄ╠╚└╒д╣дБE│д╚бе
 *      д▐д┐бд╦▄е╜е╒е╚ежезевд╬ецб╝е╢д▐д┐д╧еиеєе╔ецб╝е╢длдщд╬дддлд╩дБE¤
 *      ═│д╦┤Ёд┼дп└┴╡сдлдщдтбд╛х╡н├°║√╘в╝╘дкдшд╙TOPPERSе╫е·┴╕езепе╚дБE *      ╠╚└╒д╣дБE│д╚бе
 * 
 *  ╦▄е╜е╒е╚ежезевд╧бд╠╡╩▌╛┌д╟─є╢бд╡дБE╞дддБEтд╬д╟двдБEе╛х╡н├°║√╘в╝╘дк
 *  дшд╙TOPPERSе╫е·┴╕езепе╚д╧бд╦▄е╜е╒е╚ежезевд╦┤╪д╖д╞бд╞├─ъд╬╗╚═╤╠▄┼к
 *  д╦┬╨д╣дБEм╣ч└ндт┤▐дсд╞бддддлд╩дБE▌╛┌дт╣╘дБE╩ддбед▐д┐бд╦▄е╜е╒е╚ежез
 *  евд╬═°═╤д╦дшдБE╛└▄┼кд▐д┐д╧┤╓└▄┼кд╦└╕д╕д┐дддлд╩дБE╗│▓д╦┤╪д╖д╞дтбдд╜
 *  д╬└╒╟ддЄ╔щдБE╩ддбе
 * 
 *  @(#) $Id: chip_config.c 698 2015-07-27 22:51:58Z roi $
 */

/*
 * е┐б╝е▓е├е╚░═┬╕ете╕ехб╝еБE╩samd51x═╤б╦
 */
#include "kernel_impl.h"
#include <sil.h>

#include "samd51x.h"
#include "chip_serial.h"

/*
 *  е┐б╝е▓е├е╚░═┬╕д╬╜щ┤БE╜
 */
void
target_initialize(void){

	/*
	 * е│ев░═┬╕д╬╜щ┤БE╜
	 */
	core_initialize();

	/*
	 *  е╨е╩б╝╜╨╬╧═╤д╬е╖еБEвеБEщ┤БE╜
	 */
	chip_uart_init(SIO_PORTID);

	/*
	 *  е┐еде▐д╬│ф╣■д▀еБE┘еБE╬└▀─БE	 */
	sil_wrb_mem((uint8_t *)(TADR_SCB_BASE+TOFF_SCB_SHP15), (14 << (8 - 4)) & 0xff);
} 


/*
 *  е┐б╝е▓е├е╚░═┬╕д╬╜к╬╗╜ш═¤
 */
void
target_exit(void)
{
	/*
	 *  е│ев░═┬╕д╬╜к╬╗╜ш═¤
	 */
	core_terminate();

	/*
	 *  │л╚п┤─╢н░═┬╕д╬╜к╬╗╜ш═¤
	 */
	while(1);
}


/*
 *  е╖е╣е╞ере·┴░д╬─уеБE┘еБE╨╬╧д╬д┐дсд╬╩╕╗·╜╨╬╧
 */
void
target_fput_log(int8_t c)
{
	if (c == '\n') {
		sio_pol_snd_chr('\r', SIO_PORTID);
	}
	sio_pol_snd_chr(c, SIO_PORTID);
}
